# IsRebarShapeDriven Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Rebar..::..IsRebarShapeDriven Method
Rebar Class See Also
---
Returns true if the rebar is shape driven and false if free form.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsRebarShapeDriven()
```

Visual Basic
---
```text
Public Function IsRebarShapeDriven As Boolean
```

Visual C++
---
```text
public:
bool IsRebarShapeDriven()
```

# ### Return Value
Returns true if the rebar is shape driven and false if free form.
# See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace